Documents/ЗаказПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ЗаказПоставщика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказПоставщика/Ext/ManagerModule.bsl
Процедура ПечатьЗаказПоставщику(ТабДок, Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщика.Номер КАК Номер,
		|	ЗаказПоставщика.Дата КАК Дата,
		|	ЗаказПоставщика.Контрагент КАК Контрагент,
		|	ЗаказПоставщика.Договор КАК Договор,
		|	ЗаказПоставщика.Ссылка КАК Ссылка,
		|   ЗаказПоставщика.Сумма КАК СуммаИтого,
		|	ЗаказПоставщика.Товары.(
		|		Номенклатура,
		|		Количество,
		|		Цена,
		|		Сумма
		|	) КАК Товар
		|ИЗ
		|	Документ.ЗаказПоставщика КАК ЗаказПоставщика
		|ГДЕ
		|	ЗаказПоставщика.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	// Вывод макета
	Макет = Документы.ЗаказПоставщика.ПолучитьМакет("Макет");
	ЗаголовокОбл = Макет.ПолучитьОбласть("Заголовок");
	ШапкаОбл = Макет.ПолучитьОбласть("Шапка");
	ТоварыШапкаОбл = Макет.ПолучитьОбласть("ТоварыШапка");
	ТоварыОбл = Макет.ПолучитьОбласть("Товары");
	ПодвалИтогОбл = Макет.ПолучитьОбласть("ПодвалИтог");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
			
			ТабДок.Вывести(ЗаголовокОбл);
			
			ШапкаОбл.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ШапкаОбл, Выборка.Уровень());
			
			ТабДок.Вывести(ТоварыШапкаОбл);
			
			ВыборкаТовары = Выборка.Товар.Выбрать();
			Пока ВыборкаТовары.Следующий() Цикл
				ТоварыОбл.Параметры.Заполнить(ВыборкаТовары);
				ТабДок.Вывести(ТоварыОбл, ВыборкаТовары.Уровень());
			КонецЦикла;
			
			ПодвалИтогОбл.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ПодвалИтогОбл);
			
			ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
		
КонецПроцедуры
